{
  "file_id": "4d192781",
  "name": "8.2a1h Context Utilization with LLM 上下文利用率.md",
  "path": "8. 人工智能/8.2 如何優化RAG服務/8.2a1a 優化指標/8.2a1h Context Utilization with LLM 上下文利用率.md",
  "content": "\n## LLM as a judge  \n\n## Required\n- User Input -> Question\n- LLM Output -> Answer\n- **Retrieved Contexts** -> Contexts\n\n## 描述\n**上下文利用率**評估生成的回應是否充分利用檢索到的上下文資訊來完整回答用戶問題。此分數檢查回應是否包含所有必要的上下文資訊，以避免重要細節遺漏而降低回答的完整性和有效性。\n\n### 計算方法\n上下文利用率通過以下三種情況進行評估：\n\n1. **完全利用**：生成的回應包含上下文中所有相關資訊。\n2. **部分利用**：生成的回應僅包含部分上下文資訊，遺漏了某些回答問題所需的內容。\n3. **無利用**：生成的回應完全未使用上下文資訊。\n\n## 程式碼\n```python\nfrom uptrain import EvalLLM, Evals\n\n# 插入您的 OpenAI API 密鑰\nOPENAI_API_KEY = \"sk-********************\"\n\ndata = [{\n    \"question\": \"Where is the Taj Mahal and when was it built?\",\n    \"context\": \"The Taj Mahal is an ivory-white marble mausoleum located in Agra, Uttar Pradesh, India. It was built in 1631 by the fifth Mughal emperor, Shah Jahan to house the tomb of his beloved wife, Mumtaz Mahal.\",\n    \"response\": \"The Taj Mahal is located in Agra, Uttar Pradesh, India\"\n}]\n\n# 初始化上下文利用率評估\neval_llm = EvalLLM(openai_api_key=OPENAI_API_KEY)\n\n# 計算上下文利用率分數\nres = eval_llm.evaluate(\n    data = data,\n    checks = [Evals.RESPONSE_COMPLETENESS_WRT_CONTEXT]\n)\n\nprint(res)\n```\n\n範例輸出：\n```json\n[\n   {\n      \"score_response_completeness_wrt_context\": 0.5,\n      \"explanation_response_completeness_wrt_context\": \"Key points present in the context relevant to the given question:\\n1. The Taj Mahal is located in Agra, Uttar Pradesh, India.\\n2. It was built in 1631 by the fifth Mughal emperor, Shah Jahan.\\n\\nKey points present in the response relevant to the given question:\\n1. The Taj Mahal is located in Agra, Uttar Pradesh, India.\\n\\nReasoning:\\nThe question asks for the location and the construction date of the Taj Mahal. The context provides both pieces of information, stating that it is located in Agra, Uttar Pradesh, India and was built in 1631 by the fifth Mughal emperor, Shah Jahan. The response only includes the location information and does not mention the construction date, which is relevant for answering the question. Therefore, the response does not incorporate all the relevant information present in the context.\"\n   }\n]\n```\n\n在此範例中，回應僅部分利用上下文資訊，缺少建造年份資訊，因此上下文利用率分數偏低。`Explanation` 提供了詳細說明，指出回應中遺漏的關鍵內容。",
  "size": 2078,
  "lines": 54
}