{
  "file_id": "83d7ccc0",
  "name": "8.2a1p Factual Accuracy 事實準確性.md",
  "path": "8. 人工智能/8.2 如何優化RAG服務/8.2a1a 優化指標/8.2a1p Factual Accuracy 事實準確性.md",
  "content": "## LLM as a judge  \n\n## Required\n- User Input -> Question\n- LLM Output -> Response\n- **Retrieved Contexts** \n\n## 描述\n**事實準確性**評估生成的回應是否根據提供的上下文是事實正確的。此分數測量回應中的各個陳述在上下文支持下的真實性，尤其適用於醫療、金融和法律等領域。未經驗證的事實可能會削弱回應的可信度，因此事實準確性對這些應用非常重要。\n\n## 計算方法\n事實準確性通過以下步驟進行評估：\n\n1. **拆分回應為個別事實**：將回應拆解成各個獨立的事實陳述。\n2. **逐一評估事實**：檢查每個事實是否與上下文一致，並分類為以下三種情況：\n   - 完全正確（分數為 1）\n   - 完全錯誤（分數為 0）\n   - 模糊不清（分數為 0.5）\n3. **計算最終分數**：取各個事實的分數平均值，得到回應的總體事實準確性分數。\n\n## 程式碼\n```python\nfrom uptrain import EvalLLM, Evals\n\n# 插入您的 OpenAI API 密鑰\nOPENAI_API_KEY = \"sk-********************\"\n\ndata = [{\n    \"question\": \"What are the symptoms of heart attack?\",\n    \"context\": \"Heart attacks are often characterized by a combination of symptoms, including chest pain or discomfort, upper body pain or discomfort in the arms, back, neck, jaw, or upper stomach, shortness of breath, and cold sweats, nausea, or lightheadedness.\",\n    \"response\": \"Heart attacks are typically marked by a sharp, shooting pain in the arm. Other symptoms may include a feeling of indigestion or heartburn, along with general fatigue and headache.\"\n}]\n\n# 初始化事實準確性評估\neval_llm = EvalLLM(openai_api_key=OPENAI_API_KEY)\n\n# 計算事實準確性分數\nres = eval_llm.evaluate(\n    data = data,\n    checks = [Evals.FACTUAL_ACCURACY]\n)\n\nprint(res)\n```\n\n範例輸出：\n```json\n[\n   {\n      \"score_factual_accuracy\": 0.25,\n      \"explanation_factual_accuracy\": \"1. Heart attacks are typically marked by a sharp, shooting pain in the arm.\\nReasoning for yes: The context mentions upper body pain or discomfort in the arms as a symptom of heart attack, which can be interpreted as a sharp, shooting pain in the arm.\\nReasoning for no: The context does not explicitly mention a sharp, shooting pain in the arm as a typical symptom of heart attack.\\nJudgement: unclear. The context does not explicitly support the fact, but the symptom mentioned can be interpreted as similar to the fact.\\n\\n2. Other symptoms may include a feeling of indigestion or heartburn.\\nReasoning for yes: The context mentions chest pain or discomfort as a symptom of heart attack, which can be interpreted as a feeling of indigestion or heartburn.\\nReasoning for no: The context does not explicitly mention indigestion or heartburn as symptoms of heart attack.\\nJudgement: unclear. The context does not explicitly support the fact, but the symptom mentioned can be interpreted as similar to the fact.\\n\\n3. Other symptoms may include general fatigue.\\nReasoning for yes: No arguments.\\nReasoning for no: The context does not mention general fatigue as a symptom of heart attack.\\nJudgement: no. The context does not verify the fact nor the fact can be logically derived from the context.\\n\\n4. Other symptoms may include headache.\\nReasoning for yes: The context does not mention headache as a symptom of heart attack.\\nReasoning for no: No arguments.\\nJudgement: no. The context does not verify the fact nor the fact can be logically derived from the context.\\n\\n\"\n   }\n]\n```\n\n在這個範例中，回應中的症狀描述未完全符合上下文，導致較低的**事實準確性**分數。`Explanation` 提供了每個事實的詳細解釋。\n\n## 參考資料：\nhttps://docs.uptrain.ai/predefined-evaluations/context-awareness/factual-accuracy",
  "size": 3101,
  "lines": 59
}